Tekla Open API Reference for Tekla Structures 2025
SectionViewLabelMarkPropertyElementTypes Methods
The PropertyElement.PropertyElementType.SectionViewLabelMarkPropertyElementTypes type exposes the following members.
Methods
Name | Description
DrawingName
Returns the drawing name property element type.
Scale
Returns the scale property element type.
SectionName
Returns the section name property element type.
SourceDrawingName
Returns the source drawing name property element type.
SourceDrawingNameWhenMoved
Returns the source drawing name when moved property element type.
Top
See Also
Reference
PropertyElement.PropertyElementType.SectionViewLabelMarkPropertyElementTypes Class
Tekla.Structures.Drawing Namespace